trade_exp/src/InformationRegisters/АнкетированиеОтветы/АнкетированиеОтветы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="643577fd-9487-4e88-8c72-f629d61be78a">
  <name>АнкетированиеОтветы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="baaf8d9e-d4a6-4963-8596-754959116e3a">
    <name>Ответ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="e256b4bd-802d-49bb-b102-a8a503cdade3">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9b8e7ba-6e34-4fc4-ab59-9b811bce2b8e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="450b72de-90b7-4737-bff9-c7f6bdd9000a">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4718741d-63cc-449c-a76e-28dbde8626b3">
    <name>Респондент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de8e365b-475f-42e3-a8ba-6e024fccc41c">
    <name>ШаблонАнкеты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a8389e52-1ac9-4fa5-b40a-4f0ef8acad3e">
    <name>Вопрос</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="95c1ddea-87da-4937-a9f2-da03fedf4b21">
    <name>НомерВарианта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="01ec4547-6443-416c-946b-51cf00035440">
    <name>ДатаЗаполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ВопросыАнкетАльтерра/ВопросыАнкетАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7c044ee1-88ed-435b-98d3-1486fbd1b9bc">
  <name>ВопросыАнкетАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="44a9be50-cf80-4f87-814a-46748276b3c3">
    <name>Вопрос</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0b1881e-044b-4e28-a81c-23258b48cce3">
    <name>ПорядковыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/АнкетированиеОтветы/Forms/ФормаАнкетирования/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаНазад.Видимость = Ложь;
	Элементы.ФормаГотово.Видимость = Ложь;
	Элементы.ФормаДалее.Доступность = Ложь;
	ДатаЗаполнения = ТекущаяДата();
	НомерВопроса = 0;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Если Не Параметры.Респондент.Пустая() Тогда
		Респондент = Параметры.Респондент;
	КонецЕсли;
	если Параметры.Свойство("ВзаимодействиеОснование") тогда
		ВзаимодействиеОснование=Параметры.ВзаимодействиеОснование;
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Если Элементы.ПервыйЭтап.Видимость Тогда
		Элементы.ПервыйЭтап.Видимость = Ложь;
		Элементы.ВторойЭтап.Видимость = Истина;
		Элементы.ФормаНазад.Видимость = Истина;
		ВывестиВопрос(СписокВопросов[НомерВопроса].Значение);
	Иначе
		ДобавитьОтвет(СписокВопросов[НомерВопроса].Значение);
		НомерВопроса = НомерВопроса + 1;
		ВывестиВопрос(СписокВопросов[НомерВопроса].Значение);
	КонецЕсли;
	Если НомерВопроса = СписокВопросов.Количество() - 1 Тогда
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаГотово.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если НомерВопроса = 0 Тогда
		Ответы.Очистить();
		Элементы.ФормаНазад.Видимость = Ложь;
		Элементы.ВторойЭтап.Видимость = Ложь;
		Элементы.ПервыйЭтап.Видимость = Истина;
	Иначе
		ДобавитьОтвет(СписокВопросов[НомерВопроса].Значение);
		НомерВопроса = НомерВопроса - 1;
		ВывестиВопрос(СписокВопросов[НомерВопроса].Значение);
		Если НомерВопроса = СписокВопросов.Количество() - 2 Тогда
			Элементы.ФормаГотово.Видимость = Ложь;
			Элементы.ФормаДалее.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьКнопок()
	Если Не Анкета.Пустая() И Не Респондент.Пустая() Тогда
		СписокСформирован = СформироватьСписокВопросов();
		Если СписокСформирован Тогда
			Элементы.ФормаДалее.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.ФормаДалее.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьСписокВопросов()
	//ВыборкаАнкет = РегистрыСведений.АнкетированиеОтветы.Выбрать(Новый Структура("Респондент", Респондент));
	//ЕстьАнкета = Ложь;
	//Пока ВыборкаАнкет.Следующий() Цикл
	//	Если ВыборкаАнкет.ШаблонАнкеты = Анкета Тогда
	//		ЕстьАнкета = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если Не ЕстьАнкета Тогда
		Выборка = Справочники.ВопросыАнкетАльтерра.Выбрать(, Анкета);
		СписокВопросов.Очистить();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ЭтоГруппа Тогда
				НовыйВопрос = СписокВопросов.Добавить();
				НовыйВопрос.ПорядковыйНомер = Выборка.ПорядковыйНомер;
				НовыйВопрос.Значение = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		СписокВопросов.Сортировать("ПорядковыйНомер");
		Возврат Истина;
	//Иначе
	//	Сообщить("Респондент уже участвовал в данном опросе");
	//	Возврат Ложь;
	//КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РеспондентПриИзменении(Элемент)
	ДоступностьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура АнкетаПриИзменении(Элемент)
	ДоступностьКнопок();
КонецПроцедуры

&НаСервере
Процедура ВывестиВопрос(Вопрос)
	Элементы.ВариантыОтветов.Видимость = Ложь;
	Элементы.Ответ.Видимость = Ложь;
	Элементы.ТекстВопроса.Заголовок = Вопрос.Наименование;
	Массив = Ответы.НайтиСтроки(Новый Структура("Вопрос", Вопрос));
	Если Вопрос.Вопрос.НесколькоВариантовОтвета Тогда
		Элементы.ВариантыОтветов.Видимость = Истина;
		Выборка = Справочники.ВариантыОтветовНаВопрос.Выбрать(, Вопрос.Вопрос);
		ВариантыОтветов.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ВариантыОтветов.Добавить();
			НоваяСтрока.Вариант = Выборка.Ссылка.Значение;
		КонецЦикла;
		Если Массив.Количество() > 0 Тогда
			Для Каждого Элемент Из Массив Цикл
				СтрокиОтветов = ВариантыОтветов.НайтиСтроки(Новый Структура("Вариант", Элемент.Ответ));
				Для Каждого Строка Из СтрокиОтветов Цикл
					Строка.Ответ = Истина;
				КонецЦикла;
			КонецЦикла;
			Пока Массив.Количество() <> 0 Цикл
				Ответы.Удалить(Массив[0]);
				Массив.Удалить(0);
			КонецЦикла;	
		КонецЕсли;
	Иначе
		Ответ = Неопределено;
		Элементы.Ответ.Видимость = Истина;
		Если Массив.Количество() > 0 Тогда
			Ответ = Массив[0].Ответ;
			Пока Массив.Количество() <> 0 Цикл
				Ответы.Удалить(Массив[0]);
				Массив.Удалить(0);
			КонецЦикла;
		Иначе
			Элементы.Ответ.ОграничениеТипа = Вопрос.Вопрос.ТипЗначения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтвет(Вопрос)
	Если Вопрос.Вопрос.НесколькоВариантовОтвета Тогда
		НомерВарианта = 1;
		Для Каждого Строка Из ВариантыОтветов Цикл
			Если Строка.Ответ Тогда
				НоваяСтрока = Ответы.Добавить();
				НоваяСтрока.Респондент = Респондент;
				НоваяСтрока.ШаблонАнкеты = Анкета;
				НоваяСтрока.Вопрос = Вопрос;
				НоваяСтрока.НомерВарианта = НомерВарианта;
				НоваяСтрока.Ответ = Строка.Вариант;
				НомерВарианта = НомерВарианта + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НоваяСтрока = Ответы.Добавить();
		НоваяСтрока.Респондент = Респондент;
		НоваяСтрока.ШаблонАнкеты = Анкета;
		НоваяСтрока.Вопрос = Вопрос;
		НоваяСтрока.НомерВарианта = 0;
		НоваяСтрока.Ответ = Ответ; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГотовоНаСервере()
	Если Ответы.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.АнкетированиеОтветы.СоздатьНаборЗаписей();
		НаборЗаписей.Записывать = Истина;
		Для Каждого Строка Из Ответы Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Респондент = Строка.Респондент;
			НоваяЗапись.ШаблонАнкеты = Строка.ШаблонАнкеты;
			НоваяЗапись.Вопрос = Строка.Вопрос;
			НоваяЗапись.НомерВарианта = Строка.НомерВарианта;
			НоваяЗапись.Ответ = Строка.Ответ;
			НоваяЗапись.Дата = ДатаЗаполнения;
			НоваяЗапись.ДатаЗаполнения = ДатаЗаполнения;
			НоваяЗапись.Ответственный = Ответственный;
			НоваяЗапись.ВзаимодействиеОснование = ВзаимодействиеОснование;

		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ДобавитьОтвет(СписокВопросов[НомерВопроса].Значение);
	ГотовоНаСервере();
	Закрыть();
КонецПроцедуры
